April
August
December
February
Friday
January
July
June
March
May
November
October
Saturday
September
Sunday
Thursday
a.m.
absent
accent
account
across
activate
activity
actor
add
address
afraid
after
afternoon
again
age
ago
agree
air
airport
aisle
allergy
allowed
almost
alone
always
amount
ancient
angry
animal
anniversary
announcement
answer
anything
anytime
apartment
app
apple
april
area
arm
armchair
arrival
arrive
art
artist
ask
asleep
atm
attention
audience
august
aunt
author
autumn
available
avenue
awake
baby
back
backpack
bad
bag
balance
balcony
ball
balloon
banana
bandage
bank
barcode
bargain
basket
bath
bathroom
beach
beard
beautiful
because
bed
bedroom
before
begin
behave
behind
bell
belt
bench
better
big
bike
bill
biography
bird
birthday
biscuit
black
blanket
block
blow
blue
board
boarding
body
bonus
book
booking
bookstore
boot
booth
boring
borrow
boss
bottle
bottom
box
boy
brake
branch
brand
brave
bread
break
breakfast
breathe
breeze
bridge
bring
broken
broom
brother
brown
brush
bucket
build
building
bus
bus stop
business
busy
butter
buy
bye
cab
cable
cafe
cake
calendar
call
caller
calm
camera
cancel
candle
car
card
care
career
careful
carefully
carriage
carry
cart
cash
cashier
cat
catalog
catch
cavity
celebrate
celebration
chair
change
chapter
charity
chase
chat
cheap
check
checkout
cheer
cheese
chef
chess
chicken
child
children
chips
chocolate
choose
church
cinema
circle
city
clap
class
classmate
classroom
clean
clever
click
client
climb
clinic
clock
closed
clothes
cloud
cloudy
clown
club
coach
coat
code
coffee
coin
cola
cold
colleague
collect
college
color
comb
combo
come
comedy
comfort
comfortable
comic
commute
compartment
computer
conductor
confirm
connect
contact
contract
cook
cookie
cool
copy
corner
correct
cost
costume
cotton
couch
cough
count
counter
country
coupon
course
cousin
cover
coverage
coworker
cozy
cream
credit
credit card
cross
crowd
crowded
crust
cry
cup
curly
curtain
cushion
customer
customs
cut
cute
damaged
dance
dancing
dark
data
date
daughter
day
deadline
deal
debit
decay
december
decorate
deep
defect
degree
degrees
delay
delicious
deliver
dentist
depart
departure
deposit
desk
dessert
device
dial
dictionary
different
difficult
digit
dining room
dinner
direct
direction
dirty
discount
dish
dishes
distance
doctor
dog
dollar
donate
doorbell
dose
dot
double
downstairs
downtown
dozen
draw
dream
dress
drill
drink
drinks
drive
driver
drop
drops
dry
duck
dust
each other
ear
early
earn
easy
eat
edge
egg
eggs
eight
eighteen
eighty
elevator
eleven
email
end
engine
engineer
enjoy
entrance
envelope
erase
eraser
escalator
evening
event
everyone
exam
example
excellent
exchange
excited
excuse
exercise
exhibit
exit
expensive
experience
express
extra
eye
eyes
face
fair
fall
family
famous
far
fare
farewell
farm
farmer
fast
fat
father
faulty
favorite
february
fee
feel
feeling
festival
fever
fiction
fifteen
fifty
fight
file
fill
filling
find
finish
fireworks
first
fish
fit
fits
five
fix
flat
flight
floor
floss
flower
fly
fog
foggy
follow
food
forecast
foreign
forest
forget
fork
form
forty
four
fourteen
frame
free
freeze
fresh
friday
friend
friendly
friends
friendship
frisbee
from
front
frozen
fruit
fuel
full
fun
funny
furniture
future
gallery
game
garbage
garden
garlic
gate
gel
generous
gentle
gentleman
ghost
giant
gift
gigabyte
girl
girlfriend
give
glad
glass
glasses
gloves
goal
gold
good
goodbye
goodnight
grade
grandfather
grandmother
grandparent
grapes
grass
great
green
greet
ground
group
grow
guess
guest
guide
guitar
gum
gym
hair
half
hallway
hand
handshake
handsome
hang
happen
happy
hard
hat
have to
head
headache
health
healthy
hear
heart
heavy
hello
help
hi
hide
high
highchair
highway
hill
history
hobby
hold
home
homeless
homework
honk
hope
hospital
host
hot
hotel
hour
hours
house
housewarming
hug
hundred
hungry
hurry
hurt
husband
ice
idea
important
in
include
income
information
injection
interested
interesting
internet
introduce
invest
invite
item
jacket
january
jar
job
join
joke
journey
juice
july
jump
june
keep
kettle
key
kick
kids
kind
kindness
kiss
kitchen
kite
knee
knife
knock
lab
label
lady
lake
lamp
land
landlord
lane
large
last name
late
later
laugh
leaf
learn
leave
left
leg
lesson
letter
librarian
library
life
lift
light
lightning
like
limit
line
list
listen
little
live
living room
loan
lobby
local
lonely
long
lost
loud
lounge
lovely
luck
luggage
lunch
machine
magazine
magic
mail
mailbox
main
man
manager
manner
map
march
marker
market
married
mask
math
may
meal
meat
medicine
medium
meet
meeting
member
memory
menu
mess
message
meter
metro
middle
milk
million
minute
minutes
mirror
miss
missed
mobile
mobile phone
moment
monday
money
monster
month
monthly
mood
moon
mop
morning
mother
mountain
mouth
move
movie
muffin
mug
muscle
museum
mushroom
music
mute
name
nap
napkin
nature
near
neck
need
needy
neighbor
nephew
nervous
network
new
news
newspaper
next
nice
nickname
niece
night
nightmare
nine
nineteen
ninety
noise
noon
nose
note
notebook
notice
novel
november
numb
number
nurse
o'clock
occasion
october
offer
office
old
older
one
onion
open
orange
order
outside
oval
oven
overtime
owner
p.m.
pack
package
page
pain
painkiller
paint
painting
pair
pan
paper
parade
parcel
parent
park
partner
party
passenger
passport
password
past
path
patients
pay
pen
pencil
people
pepper
permission
person
pet
pharmacy
phone
photo
piano
pick
pickup
picnic
picture
piece
pill
pillow
pilot
pin
pizza
plan
plane
plant
plastic
plate
platform
play
player
pleasure
plug
plus
pocket
poem
point
points
policy
polite
pond
poor
popcorn
popular
postcard
poster
postman
pot
potato
practice
pray
prepaid
prescription
present
presentation
pretty
price
print
printer
private
prize
problem
product
profit
program
project
promise
proud
provider
pull
push
put
quarter
question
queue
quickly
quiet
rabbit
race
rail
railway
rain
rainbow
rainy
raise
reach
read
ready
real
reason
receipt
reception
recipe
red
refreshment
refund
relax
remember
renew
rent
repeat
reply
report
reservation
reserve
respect
rest
restart
resume
return
reward
ribbon
rice
rich
ride
right
ring
ringtone
rinse
ripe
river
road
romantic
room
round
roundabout
route
router
row
rude
rug
rule
ruler
run
running
runny
rush
sad
safe
salad
salary
sale
salon
salt
sandwich
saturday
sauce
save
savings
scared
scarf
scary
scene
schedule
school
science
scientist
scissors
score
screen
sculpture
sea
season
seat
seatbelt
seats
second
section
security
see
sell
send
sender
sentence
september
serve
service
seven
seventeen
seventy
shade
shadow
shake
shampoo
shape
share
shave
shelf
shift
shirt
shoe
shoes
shop
short
shoulder
shout
show
shower
shy
sick
side
sign
signal
silence
sing
singer
single
sink
sir
sister
sit
six
sixteen
sixty
size
sketch
skill
sky
sleep
sleepy
sleeve
slice
slide
slippers
slow
small
smart
smell
smile
smoking
snack
sneeze
snow
snowy
soap
sock
soda
sofa
son
song
soon
sore
sorry
sound
sounds
soup
spare
speak
speaker
special
speed
spell
spend
spice
spicy
sponge
spoon
sport
spray
spring
square
staff
stage
stain
stairs
stamp
stand
star
start
starter
station
statue
stay
step
stomach
stop
store
storm
story
stove
straight
strange
stranger
street
stretch
strict
strong
student
study
style
suburb
subway
sugar
suitcase
summer
sun
sunday
sunny
supermarket
surprise
swap
sweat
sweep
sweet
sweets
swim
swing
switch
syrup
table
tablecloth
tablet
tag
talk
tall
tape
task
taste
tasty
taxi
tea
teach
teacher
team
teammate
tears
teeth
teller
temperature
ten
terminal
terrible
test
text
textbook
thank
thanks
theater
thick
thin
think
thirsty
thirteen
thirty
thousand
three
throat
throw
thunder
thursday
ticket
tidy
till
time
timetable
tip
tired
tissue
title
today
together
toilet
tomato
tomorrow
tonight
tool
tooth
top
topping
total
touch
towel
town
track
traffic
train
transfer
travel
tree
triangle
trim
trip
trolley
true
try
tuesday
tunnel
turn
twelve
twenty
twice
two
ugly
umbrella
uncle
under
underground
understand
uniform
unlimited
until
upset
upstairs
useful
vacation
vegetable
vegetarian
video
view
visit
vitamin
voice
voicemail
volunteer
wait
waiter
waiting
waitress
wake
walk
wall
wallet
warm
wash
watch
water
wave
weak
wear
weather
wednesday
week
weekend
weigh
weight
weird
welcome
well
wet
whisper
whistle
white
wife
wifi
win
wind
window
windy
winner
winter
wipe
wish
withdraw
woman
wonderful
word
work
worker
working
works
world
worn
worried
write
writer
wrong
yard
year
yesterday
yogurt
young
younger
zero
zip
