a.m.
account
activity
add
address
afternoon
again
age
ago
airport
aisle
allowed
almost
alone
animal
answer
anything
anytime
apartment
apple
april
arm
arrive
art
artist
ask
asleep
atm
august
aunt
available
awake
baby
back
bad
bag
bank
bath
bathroom
beach
beautiful
because
bed
bedroom
begin
better
bike
bill
birthday
blanket
blue
body
book
bookstore
boring
borrow
boss
bottle
bottom
box
boy
bread
break
breakfast
breathe
bridge
bring
brother
brush
build
building
bus
business
busy
buy
cafe
cake
call
camera
candle
card
care
careful
carefully
carry
cash
celebrate
celebration
chair
change
cheap
check
cheese
chicken
child
children
choose
church
cinema
circle
city
class
classmate
classroom
clean
clever
climb
clock
closed
clothes
cloud
cloudy
club
coat
coffee
cold
college
color
come
computer
connect
cook
cool
copy
corner
correct
cost
couch
cough
country
cousin
cozy
credit card
cry
cup
cut
cute
dance
dancing
dark
data
daughter
day
december
delicious
deliver
deposit
dictionary
different
difficult
dining room
dinner
dirty
dishes
doctor
dollar
draw
dream
drink
drinks
drive
driver
drop
dry
each other
ear
early
easy
eggs
eighteen
eighty
elevator
eleven
email
engineer
evening
excellent
excited
excuse
exercise
extra
eye
face
family
famous
far
farm
farmer
fast
fat
father
favorite
february
fee
feel
feeling
festival
fever
fifteen
fifty
fight
file
fill
find
finish
first
fit
fits
five
fix
flat
flight
floor
flower
food
forget
form
forty
four
fourteen
free
fresh
friday
friend
friends
from
front
full
fun
game
garbage
gate
gift
girl
girlfriend
glad
glass
gold
good
goodbye
goodnight
grade
grandfather
grandmother
grandparent
great
green
ground
group
grow
guess
guitar
gym
hair
half
handsome
happen
happy
hard
hat
have to
head
health
healthy
hear
heart
heavy
help
hi
high
hill
history
hobby
home
hospital
hot
hotel
hour
hours
house
hug
hungry
hurry
hurt
husband
idea
important
in
include
information
interested
interesting
internet
jacket
january
job
join
july
jump
june
keep
key
kind
kiss
kitchen
lady
large
last name
late
later
laugh
learn
leave
left
leg
letter
library
life
lift
light
like
line
list
listen
little
live
living room
lonely
long
lost
lovely
luck
lunch
machine
magazine
mail
man
map
march
married
may
meal
medicine
medium
meet
meeting
member
menu
middle
milk
minute
minutes
mirror
miss
mobile phone
moment
monday
money
month
moon
morning
mother
mountain
mouth
move
movie
museum
music
name
nap
nature
near
neck
need
neighbor
new
news
newspaper
next
nice
night
nine
nineteen
ninety
noise
noon
nose
note
notebook
november
number
nurse
o'clock
october
office
older
open
order
outside
owner
p.m.
pack
package
page
pain
paint
painting
pair
paper
parent
park
party
passport
password
past
pay
pen
pencil
people
person
phone
photo
pick
picnic
picture
piece
pill
pillow
pizza
plan
plane
plate
platform
play
player
pleasure
pocket
poor
popular
practice
pretty
price
print
problem
program
push
put
quarter
question
quickly
quiet
rain
rainy
read
ready
real
receipt
red
relax
rent
repeat
report
rest
return
rice
rich
ride
right
room
rude
rule
run
running
sad
salad
sale
saturday
science
scientist
sea
seat
second
see
send
sentence
september
seven
seventeen
seventy
shake
shirt
shoe
shop
short
show
shower
sick
side
sign
single
sister
sit
six
sixteen
sixty
size
sky
sleep
slow
small
smell
smoking
snowy
sofa
son
soon
sounds
speak
spell
sport
spring
stamp
stand
star
start
station
stay
step
stop
store
story
straight
strange
street
stretch
strong
style
subway
sugar
summer
sun
sunday
sunny
supermarket
surprise
sweet
table
talk
tall
taxi
tea
teach
teacher
ten
terrible
thank
thanks
theater
thick
thin
think
thirteen
thirty
three
throat
throw
thursday
ticket
time
tip
tired
toilet
tomorrow
tonight
tool
tooth
top
total
touch
town
traffic
train
travel
tree
trip
true
try
tuesday
turn
twelve
twenty
twice
ugly
umbrella
uncle
until
vacation
video
visit
wait
waitress
walk
wall
warm
wash
water
wear
weather
wednesday
week
weekend
weight
welcome
wife
wifi
wind
window
wish
woman
wonderful
word
work
worker
working
works
world
write
writer
yard
year
young
younger
